src/cf/Reports/fmRoutePassMap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>fmRoutePassMap</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ItemWidth</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ItemHeight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RouteDocument</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAgreeDocumentTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RouteModel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmAgreementRoutes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutputAllPoints</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comments</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/fmRouteStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmRouteStates</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PointState</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutePointsStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAgreeDocumentTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AgreementRoute</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmAgreementRoutes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoutePoint</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Reports/fmRoutePassMap/Forms/Form/Ext/Form/Module.bsl
&AtServer
// Процедура вывода отчета
//
Procedure OutputReport()
	RoutePassingMap = FormAttributeToValue("Report");
	RoutePassingMap.WebClient        = True;
	RoutePassingMap.GenerateReport(SpreadsheetDocumentField);
	DetailsList = RoutePassingMap.DetailsList;
	Report.Comments = RoutePassingMap.Comments;
EndProcedure

&AtClient
// Процедура обработчика расшифровки отчета
//
Procedure SpreadsheetDocumentFieldDetailProcessing(Item, DetailsID, StandardProcessing)
	
	StandardProcessing = False;
	Return;
	
	Details = GetDetails(DetailsList, DetailsID);
	
	If TypeOf(Details) = Type("Structure") AND Details.Property("StageDetail") Then
		
		If ValueIsFilled(Details.Period) Then 
			
			Department = Undefined;
			If Details.Departments.Count() = 1 Then 
				Department = Details.Departments[0];
			ElsIf Details.Departments.Count() > 1 Then 
				DepartmentList = New ValueList();
				DepartmentList.LoadValues(Details.Departments);
				Result = ChooseFromMenu(DepartmentList, Item);
				If Result = Undefined Then 
					Return;
				Else
					Department = Result.Value;
				EndIf;
			Else
				Return;
			EndIf;
			
			DimensionValues = New Structure();
			DimensionValues.Insert("Period", Details.Period);
			DimensionValues.Insert("RouteDocument", Details.RouteDocument);
			DimensionValues.Insert("RouteModel", Details.RouteModel);
			DimensionValues.Insert("RoutePoint", Details.RoutePoint);
			DimensionValues.Insert("Department", Department);
			ParametersArray = New Array();
			ParametersArray.Add(DimensionValues);
			RecordKey = New(Type("InformationRegisterRecordKey.fmRouteStates"), ParametersArray);
			FormParameters = New Structure("Key", RecordKey);
			
			OpenForm("InformationRegister.fmRouteStates.Form.RecordForm", FormParameters, ThisForm, , , , , FormWindowOpeningMode.LockOwnerWindow);
			
			OutputReport();
			DetailsOpening = True;
			
		Else 
			// открытие пустой записи
			// сохранено на случай возможности перехода на произвольную
			// точку согласования
			//ПараметрыФормы = Новый Структура();
			//ПараметрыФормы.Вставить("ДосрочноеСогласование", Истина);
			//ПараметрыФормы.Вставить("ДокументМаршрута", Расшифровка.ДокументМаршрута);
			//ПараметрыФормы.Вставить("МодельМаршрута", Расшифровка.МодельМаршрута);
			//ПараметрыФормы.Вставить("ТочкаМаршрута", Расшифровка.ТочкаМаршрута);
			
			//ОткрытьФормуМодально("РегистрСведений.СостоянияПрохожденияМаршрута.Форма.ФормаЗаписи", ПараметрыФормы);
			//
			//ВывестиОтчет();
			//
			//ОткрытиеРасшифровки = Истина;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtServerNoContext
// Процедура - обработчик события "ДокументПроцессаПриИзменении"
//
Function GetDocumentName(Ref)
	Return Ref.Metadata().Name;
EndFunction // ПолучитьИмяДокумента()

&AtServerNoContext
// Процедура - обработчик события "ДокументПроцессаПриИзменении"
//
Function GetDetails(DetailsList, IndexOf)
	
	Try 
		Result = DetailsList[Number(String(IndexOf))].Value;
	Except
		Result = IndexOf;
	EndTry;
	
	Return Result;
	
EndFunction // ПолучитьРасшифровку()

&AtServerNoContext
// Процедура - обработчик события "ДокументПроцессаПриИзменении"
//
Procedure ProcessDocumentOnChange(RouteDocument, RouteModel)
	If ValueIsFilled(RouteDocument) Then
		RouteDocumentRouteModel = RouteDocument.AgreementRoute;
		If ValueIsFilled(RouteDocumentRouteModel) Then
			RouteModel = RouteDocumentRouteModel;
		EndIf;
	EndIf;
EndProcedure // ДокументПроцессаПриИзменении()

&AtServerNoContext
// Процедура - обработчик события "ШаблонПроцессаНачалоВыбора"
//
Function GetRouteModelFilter(RouteDocument, RouteModel)
	Query = New Query("SELECT ALLOWED DISTINCT
	                      |	PassingRouteStates.AgreementRoute AS AgreementRoute
	                      |FROM
	                      |	InformationRegister.fmRouteStates AS PassingRouteStates
	                      |WHERE
	                      |	PassingRouteStates.Document = &RouteDocument");
	Query.SetParameter("RouteDocument", RouteDocument);
	FilterList = New ValueList();
	FilterList.LoadValues(Query.Execute().Unload().UnloadColumn("AgreementRoute")); 
	Return FilterList;
EndFunction // ШаблонПроцессаНачалоВыбора()

&AtClient
// Обработчик события ДокументМаршрутаПриИзменении
//
Procedure RouteDocumentOnChange(Item)
	ProcessDocumentOnChange(Report.RouteDocument, Report.RouteModel);
EndProcedure // ДокументМаршрутаПриИзменении()

&AtClient
// Обработчик события МодельМаршрутаНачалоВыбора
//
Procedure RouteModelStartChoice(Item, ChoiceData, StandardProcessing)
	StandardProcessing = False;
	If ValueIsFilled(Report.RouteDocument) Then		
		
		FilterList = GetRouteModelFilter(Report.RouteDocument, Report.RouteModel);
		
		If FilterList.Count() = 0 Then
			CommonClientServer.MessageToUser(NStr("en='The document did NOT undergo any of the approval routes.';ru='Указанный документ НЕ проходил ни по одному Из маршрутов согласования!'"));
			Return;
		Else
			
			ChoiceForm = GetForm("Catalog.fmAgreementRoutes.ChoiceForm", , Item);
			
			NewFilter = ChoiceForm.List.Filter.Items.Add(Type("DataCompositionFilterItem"));
			NewFilter.LeftValue    = New DataCompositionField("Ref");
			NewFilter.ComparisonType     = DataCompositionComparisonType.InList;
			NewFilter.RightValue   = FilterList;
			NewFilter.Use    = True;
			NewFilter.ViewMode = DataCompositionSettingsItemViewMode.Inaccessible;
			
			ChoiceForm.Items.List.CurrentRow = Report.RouteModel;
			ChoiceForm.Open();
			
		EndIf;	
	Else
		CommonClientServer.MessageToUser(NStr("en='You should specify the route document.';ru='Необходимо указать документ маршрута!'"));
		Return;
	EndIf;
EndProcedure // ДокументМаршрутаПриИзменении()

&AtClient
// Обработчик события Настройка
//
Procedure Generate(Command)
	If NOT ValueIsFilled(Report.RouteDocument) Then 
		CommonClientServer.MessageToUser(NStr("en='The document is not filled in.';ru='Не заполнен документ.'"));
		Return;
	EndIf;
	If NOT ValueIsFilled(Report.RouteModel) Then 
		CommonClientServer.MessageToUser(NStr("en='The approval route is not filled in.';ru='Не заполнен маршрут согласования.'"));
		Return;
	EndIf;
	OutputReport();
EndProcedure

&AtClient
// Обработчик события Настройка
//
Procedure Setting(Command)
	SettingForm = GetForm("Report.fmRoutePassMap.Form.ReportSetting");
	FillPropertyValues(SettingForm, Report);
	Result = SettingForm.DoModal();
	If Result <> Undefined AND Result Then
		FillPropertyValues(Report, SettingForm);
		OutputReport();
	EndIf;
EndProcedure // Настройка()

&AtServer
// Обработчик события ПриСозданииНаСервере
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("RouteModel") Then 
		Report.RouteModel = Parameters.RouteModel;
	EndIf;
	If Parameters.Property("Version") Then 
		Report.Version = Parameters.Version;
	EndIf;
	If Parameters.Property("RefToDocument") Then 
		Report.RouteDocument = Parameters.RefToDocument;
		If NOT ValueIsFilled(Report.RouteModel) Then 
			Report.RouteModel = Report.RouteDocument.AgreementRoute;
		EndIf;
	EndIf;
	If ValueIsFilled(Report.RouteDocument) AND ValueIsFilled(Report.RouteModel) Then 
		OutputReport();
	EndIf;
	DetailsOpening = False;
EndProcedure // ПриСозданииНаСервере()
